module Meow
  Dictionaries = [
    [3, "Кошка %s — мявкалка %s", %w[трясётся соберётся придётся разберётся вернётся доберётся проберётся уберётся заберётся подберётся прострётся 
      наберётся отречётся напряжётся прервётся взберётся подерётся бережётся переберётся придерётся остережётся продерётся стрижётся обопрётся 
      остаётся сотрётся потрётся отопрётся скребётся разревётся задерётся заречётся оберётся разбредётся коснётся поостережётся оторвётся передерётся 
      смеётся улыбнётся притрётся побережётся впряжётся приберётся обережётся засмеётся берётся свернётся ведётся запрётся несётся дерётся донесётся 
      поперхнётся перевернётся пронесётся рассмеётся ошибётся найдётся сведётся передаётся расстаётся клянётся увлечётся упрётся понесётся займётся 
      вгрызётся прижмётся перельётся извернётся перенесётся выдаётся приведётся попрётся посмеётся спасётся пересечётся достаётся увернётся разнесётся 
      усмехнётся отвлечётся встрепенётся грызётся зажрётся шевельнётся внесётся живётся поклянётся прикоснётся доведётся споткнётся начнётся захлебнётся 
      переведётся заикнётся предаётся отобьётся растечётся наткнётся развлечётся кувыркнётся разорётся пасётся соприкоснётся ухмыльнётся плетётся 
      заведётся разрастётся поплетётся стечётся возьмётся расплывётся унесётся разведётся рехнётся провернётся выбьётся пошатнётся переплетётся 
      разовьётся уживётся занесётся удаётся вознесётся пригнётся разойдётся сорвётся перебьётся печётся ужаснётся поведётся отряхнётся толчётся 
      обожрётся создаётся дождётся чертыхнётся воспроизведётся сплетётся снесётся принесётся бьётся огрызнётся разминётся заплетётся даётся добьётся 
      рвётся ворвётся прорвётся взорвётся извлечётся продаётся столкнётся отнесётся пресечётся привьётся обзаведётся вовлечётся оборвётся попадётся 
      обойдётся разорвётся облизнётся поддаётся вплетётся срастётся приживётся раздаётся очнётся задохнётся перегнётся сошлётся наживётся уткнётся 
      колыхнётся запасётся вживётся надорвётся сдаётся пройдётся прибьётся сойдётся утрётся крадётся отзовётся рассосётся застегнётся мятётся сольётся 
      встряхнётся присосётся признаётся оснуётся порвётся всосётся перемигнётся облечётся льётся пробьётся]],
    [4, "Кошка %s — мявкалка %s", %w[спускается опускается пускается распускается купается касается покупается искупается покушается окупается окунается закупается получается 
      прикасается плескается раскупается соприкасается сужается случается кусается нуждается испугается таскается катается ругается увлекается полоскается 
      возмущается качается погружается ласкается пугается раскачается отвлекается обучается копается смущается спотыкается нарушается откликается заикается 
      заключается пересекается натыкается развлекается разрушается толкается сокрушается наблюдается сгущается ручается улучшается перекликается покатается 
      перепугается ухудшается заблуждается смыкается растекается кувыркается отрекается закачается отдувается опасается поругается пробуждается покопается 
      возбуждается бросается просыпается стекается сморкается отлучается смеркается проникается карается чурается ссылается заступается накаляется раздувается 
      гнушается извлекается поручается пытается расступается занимается вовлекается закаляется надувается включается искажается напугается разругается собирается 
      утыкается зарекается брыкается старается прокатается врубается спасается узнается загружается вздувается вооружается засмущается разувается разгружается 
      примелькается потолкается посыпается разлучается пресекается научается покачается протолкается называется возвращается прогуляется оступается поступается 
      облекается вступается считается начинается улыбается встречается мужается чуждается пресмыкается докопается вырубается приучается окопается обувается 
      простужается умудряется отличается обращается заругается раскатается раскаляется покаяться поднимается попытается якшается пререкается выгружается 
      втыкается отступается углубляется разрастается продолжается представляется раскаяться переругается излучается закопается свыкается заглушается 
      заплутается подступается развивается сомневается является изумляется усугубляется ужасается затрудняется решается постарается докатается подключается 
      общается превращается приближается полагается открывается принимается переключается кидается предполагается опирается отключается догадается располагается 
      высыпается разбирается соглашается выражается валяется отправляется сотрясается добивается кончается рождается дожидается ускоряется распространяется отмечается]],
    [3, "Кошка-%s — в мявкалке %s", %w[картошка крошка сторожка ладошка гармошка горошка мошка немножко плошка брошка сошка окрошка морошка киношка ложка дорожка ножка окошко 
      обложка лепёшка подножка матрёшка трёшка босоножка рыбёшка неотложка плодоножка порожка лукошко хромоножка поварёшка 
      острожка дрожкам сороконожка суперобложка цветоножка серёжка бомбёжка одёжка застёжка стёжка кормёжка делёжка лёжка зубрёжка широножка отрожка 
      отстёжка обножка перестёжка подстёжка полусапожкам припорошка налёжка пристёжка мохноножка пролёжка многоножка мерёжка простёжка птиценожка 
      ложноножка пустошка разножка расстёжка резвоножка рогожка кривоножка кочерёжка коротконожка корненожка руконожка клещеножка семяножка  
      стоножка зубоножка оплошка залёжка заворошка евдошка сторожко долгоножка долбёжка стремёшка дёжка двуножка строжка тёшка 
      вошка ветошка велодорожка вдёжка бульдожка толстоножка тысяченожка бомбошка шарошка блошка балабошка бабёшка]],
    [4, "Кошка %s — мявкалка %s", %w[клыкастая скуластая очкастая глазастая головастая горластая щекастая голенастая щелястая рукастая мосластая частая лобастая коренастая цветастая 
      нечастая вихрастая мордастая грудастая губастая гривастая бровастая патластая петлястая носастая ноздрястая]],
    [4, "Кошка %s — мявкалка %s", %w[красная первоклассная прекрасная внеклассная классная всевластная колбасная подвластная неподвластная негласная причастная полновластная 
      властная инфракрасная бесстрастная злосчастная контрастная самовластная беспристрастная пристрастная несогласная каркасная распрекрасная громогласная сладострастная 
      ненастная непричастная опасная ясная сопричастная ужасная безучастная безопасная разномастная неясная напрасная пястная взрывоопасная небезопасная 
      неопасная огнеопасная фугасная ежечасная ананасная третьеклассная пампасная одномастная огненно-красная повсечасная]]
  ]

  def self.syllables(word)
    word.count "аеёиоуыэюя"
  end

  def self.phrase(types = [:verb, :noun, :adjective])
    syllable_count, template, dictionary = Dictionaries.sample
    cat_word = dictionary.select{ |word| syllables(word) <= syllable_count + 1 }.sample
    meow_word = dictionary.select{ |word| syllables(word) == syllable_count and word != cat_word }.sample
    template % [cat_word, meow_word]
  end
end
